# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                      Шаблон Настройки линий питания интерфейсов
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Devices_USPD.settings import url_path
from JSON_Backend_framework.Service.TemplateDeviceFunctions import TemplateDeviceFunctions_Settings


class TemplateInterface_DOut_PowerLine(TemplateDeviceFunctions_Settings):
    """
    Шаблон Настройки линий питания интерфейсов

    """
    # URL

    _path_url = url_path.get("Settings_Dout")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None
    # Переопределяем чтоб можно было достать
    path_url = _path_url
    # Имя поля настроек
    _Settings_name = 'Settings'

    # Настройки по умолчанию


# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
