# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Шаблон Суточный профиль тарифного расписания
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Devices_USPD.settings import url_path
from JSON_Backend_framework.Service.TemplateDeviceFunctions import TemplateDeviceFunctions_MeterManagement


class TemplateCalendarDay(TemplateDeviceFunctions_MeterManagement):
    """
    Шаблон Суточный профиль тарифного расписания

    """
    # URL

    _path_url = url_path.get("Set_Calendar_Day")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None
    # Переопределяем чтоб можно было достать
    path_url = _path_url

# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
