# Здесь расположим различные настройки

# ---------------------------------- Различные URL пути - Общие----------------------------------
url_path = {
                                    # Авторизация

           "Authorization": '/auth'	,

                                    # Настройки

                        # Настройки устройства

            # Настройки Ethernet
            "Ethernet_settings": '/settings/ip',
            # Настройки линий питания интерфейсов
            "Interface_power_line_settings": '/settings/dout',
            # Настройки локального времени
            "Local_time_settings": '/settings/time/local',

            # Настройки SIM-карт (Pin, APN)
            "SIM_card_settings": '/settings/modem/sim',

                        # Клиенты и серверы
            # Настройки TCP-серверов
            "TCP_server_settings": '/settings/servers/tcp',
            # Настройки SNTP-серверов
            "SNTP_server_settings": '/settings/servers/sntp',

                        # Приборы учета
            # Таблица приборов учета
            "Metering_device_table": '/settings/meter/table',

                        # Система событий
            # Настройки менеджера системы событий
            "Event_Manager_Settings": '/settings/events/manager',
            # Настройки шаблонов приборов учета
            "Metering_device_templates_settings": '/settings/templates/meter',
            # Настройки шаблонов данных приборов учета
            "Settings_for_metering_devices_data_templates": '/settings/templates/arch',
            # Настройки расписаний
            "Schedule_settings": '/settings/events/schdl',
            # Настройки регулярного опроса приборов учета
            "Settings_for_regular_polling_of_metering_devices": '/settings/actions/meter',

                                    # Опрос приборов учета

            # Опрос приборов учета
            "Meter_Data_arch": '/meter/data/arch',

            "Meter_Data_moment": '/meter/data/moment',


                                    # Управление приборами учета

            # Установка времени
            "Time_setting": '/meter/settings/time',
            # Управление реле
            "Relay_control": '/meter/settings/relay',

                                    # Действия
            # Установка времени
            "Set_Time_setting": '/action/time/set',

            # Перезагрузка устройства
            'Device_Restart': '/action/restart',


                                    # Информация о состоянии изделия
            # Текущее время
            "Current_time": '/state/time',


}


            # ///////////////////////////////////////////////////////////
            #                Добавлено  в 40 СМАРТ
            # ///////////////////////////////////////////////////////////
url_path_smart40 = {

        # ///////////////////////////Зарядные станции//////////////////////////////////
        # -Таблица зарядных станций - Переписал
        'ChargeStationTable' : '/settings/charge/table',
        # # - Состояние зарядных станций - Переписал
        'ChargeStationArchData' : '/charge/data/arch',
        # ///////////////////////////////////////////////////////

        # ///////////////////////////////////////////////////////
        # Пока не завезено во фронтенд

        # // - таблица MeterMessages в БД системы событий - Переписал
        'MeterMessages' : '/settings/templates/messages',

        # // - таблица MQTTMeterMessages в БД системы событий - Переписал
        'MQTTMeterMessages' : '/settings/action/mqtt',

        # // - таблица Calendar в БД системы событий - Переписал
        'Calendar' : '/settings/events/calendar' ,

        # // - Таблица аккаунтов SMTP - Переписал
        'AccountSMTP' : '/settings/smtp',
        # // -  таблица SMTPMeterMessages в БД системы событий - Переписал
        'SMTPMeterMessages' : '/settings/action/smtp' ,

        # // -  таблица Email в БД системы событий - Переписал
        'settingsEmail' : '/settings/email',

        # ///////////////////// iec60870 ///////////////////////////

        # // - iec60870 - Работа с таблицей MapIOA - Переписал
         "MapIOA": '/settings/iec60870/mapioa',

        # // - iec60870 - работа с таблицей ValueDescription - переписал
        "ValueDescription": '/settings/iec60870/value_description',
        # // - iec60870 - работа с таблицей TemplateName - переписал
               "TemplateName"  : '/settings/iec60870/template_name',
        # // - iec60870 - работа с таблицей COTTypes - переписал
        'COTTypes'   : '/settings/iec60870/cot_types',
        # // - iec60870 - работа с таблицей TypeIDTypes - переписал
        'TypeIDTypes' : '/settings/iec60870/type_id_types',
        # // - iec60870 - работа с таблицей Settings - Переписал
        'IEC60870Settings'   : '/settings/iec60870/iec60870_settings',
        # // - iec60870 - работа с таблицей IEC60870Template - Переписал
         'IEC60870Template': '/settings/iec60870/iec60870_template',
        # // - iec60870 - работа с таблицей IEC60870Template - Переписал
        'IEC60870COTValues' : '/settings/iec60870/iec60870_cot_values',
           }


# ------------------------------------------------------------------------------------------------------

# //-------------------------------------------------------------------------------//
#URI path	Краткое описание
# //-------------------------------------------------------------------------------//
#                                     Авторизация
# //-------------------------------------------------------------------------------//
# Авторизация
'/auth'
# Отключение
'/logoff'
# //-------------------------------------------------------------------------------//
#                                       Настройки
# //-------------------------------------------------------------------------------//
# Настройки http авторизации
'/settings/proto/json/auth'
# Настройки авторизации текстового протокола
'/settings/proto/text/auth'
# Настройки авторизации протокола RTU-327
'/settings/proto/rtu/auth'
# Настройки выдачи данных текстового протокола
'/settings/proto/text/data'
# Настройка почтовых сообщений текстового протокола
'/settings/proto/text/mail'
# Настройки Ethernet
'/settings/ip'
# Настройки последовательных интерфейсов(UART)
'/settings/uart'
# Настройки дискретных входов
'/settings/din'
# Настройки линий питания интерфейсов
'/settings/dout'
# Настройки локального времени
'/settings/time/local'
# Настройки доступа к файловой системе
'/settings/file_system/access'
# Настройки модема
'/settings/modem'
# Настройки APN(точки доступа)
'/settings/modem/apn'
# Настройки CSD(PPP-сервер)
'/settings/modem/csd'
# Настройки TCP-серверов
'/settings/servers/tcp'
# Настройки SMTP-серверов
'/settings/servers/smtp'
# Настройки SNTP-серверов
'/settings/servers/sntp'
# Настройки MQTT-серверов
'/settings/servers/mqtt'
# Адресная книга
'/settings/address'
# Сообщения пользователя
'/settings/messages/custom'
# Сообщения с данными приборов учета
'/settings/messages/meter'
# Настройки хранения архивных данных приборов учета
'/settings/meter/arch'
# Таблица приборов учета
'/settings/meter/table'
# Настройки событий изменений дискретных входов
'/settings/events/din'
# Настройки расписаний
'/settings/events/schdl'
# Настройки регулярной отправки почтовых сообщений
'/settings/actions/smtp'
# Настройки регулярной синхронизации времени # Настройки SNTP-серверов
'/settings/actions/sntp'
# Настройки регулярного опроса приборов учета
'/settings/actions/meter'
# Настройки регулярной отправки sms сообщений
'/settings/actions/sms'
# Настройки регулярной публикации mqtt сообщений
'/settings/actions/mqtt'
# Настройки имени устройства
'/settings/name'
# //-------------------------------------------------------------------------------//
# Опрос приборов учета
# //-------------------------------------------------------------------------------//
# Опрос приборов учета
'/meter/data'
# //-------------------------------------------------------------------------------//
# Управление приборами учета
# //-------------------------------------------------------------------------------//
# Установка времени
'/meter/settings/time'
# Управление реле
'/meter/settings/relay'
# //-------------------------------------------------------------------------------//
# Действия
# //-------------------------------------------------------------------------------//
# Синхронизация времени (SNTP)
'/action/time/sync'
# Поверка внешних ЧРВ
'/action/time/check'
# Перезагрузка
'/action/restart'
# Обновление загрузчика
'/action/update/loader'
# Очистка логического диска
'/action/disk/clear'
# Установка времени
'/action/time/set'
# Синхронизация хранилища данных приборов учета
'/action/storage/sync'
# //-------------------------------------------------------------------------------//
# Журналы изделия
# //-------------------------------------------------------------------------------//
# Журнал изменения времени
'/jrnl/time'
# Журнал сетевых подключений
'/jrnl/srvconn'
# Журнал подключений PPP клиента (GPRS)
'/jrnl/ppp/clconn'
# Журнал поднятия PPP-сервера (CSD)
'/jrnl/ppp/srvconn'
# Журнал входящих вызовов (CSD)
'/jrnl/call'
# Журнал изменения состояния дискретных входов
'/jrnl/din/sens'

'/jrnl/din/pwrline'
'/jrnl/din/power'
'/jrnl/din/charge'
'/jrnl/din/open'
# Журнал авторизации (HTTP-сервер)
'/jrnl/auth/json'
# Журнал перезагрузок
'/jrnl/reset'
# Журнал хранилища почтовых сообщений
'/jrnl/mail/msg'
# Журнал отправки почтовых сообщений
'/jrnl/mail/send'
# Журнал изменения версии ВПО изделия
'/jrnl/update/version'
# Журнал обновления ВПО загрузчика изделия
'/jrnl/update/loader'
# Журнал фиксации ответов приборов учета
'/jrnl/meter/answ'
# Журнал хранилища исходящих SMS сообщений
'/jrnl/sms/msg'
# Журнал отправки SMS сообщений
'/jrnl/sms/send'
# Журнал приема SMS сообщений
'/jrnl/sms/get'
# Журнал установки связи с MQTT брокером
'/jrnl/mqtt/connect'
# Журнал обмена сообщениями с MQTT брокером
'/jrnl/mqtt/message'
# //-------------------------------------------------------------------------------//
# Информация о состоянии изделия
# //-------------------------------------------------------------------------------//
# Состояние линий питания интерфейсов
'/state/dout'
# Состояние дискретных входов
'/state/din'
# Состояние аналоговых входов
'/state/ain'
# Ожидаемое время срабатывания расписаний
'/state/schdl'
# Состояние последовательных интерфейсов
'/state/uart'
# Состояние сетевых подключений
'/state/network'
# Состояние сокетов
'/state/socket'
# Состояние микросхем памяти
'/state/dataflash'
# Состояние файловой системы
'/state/file_system'
# Состояние модема
'/state/modem'
# Состояние операционной системы
'/state/os'
# Состояние таблицы приборов учета
'/state/meter_table'
# Текущее время
'/state/time'
# Информация о конфигурации системы
'/state/system'
# //-------------------------------------------------------------------------------//
# Загрузка файлов
# //-------------------------------------------------------------------------------//
# Загрузка файлов обновления ВПО
'/upload/firmware'

'/upload/loader'
# //-------------------------------------------------------------------------------//

