# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Чтение Данных счетчиков
#                                     Моментные Показатели - Чтение с самого счетчика
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Devices_USPD.UM40.Functional.MeterData.MeterData import MeterData
from JSON_Backend_framework.Devices_USPD.settings import url_path


class MeterDataArch(MeterData):
    """
    Итак - здесь что делаем - Здесь устанавливаем Моментные показатели
    """

    _path_url = url_path.get('MeterData_Arch')

    path_url = _path_url
