# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                          Настройки хранения архивных данных приборов учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Service.Template_Devices_Functions.Settings.MeterDevice.Template_MeterArchInfo_settings import \
    TemplateMeterArchInfo


# -------------------------------------------------------------------------------------------------------------

class MeterArchInfo(TemplateMeterArchInfo):
    """
    Настройки хранения архивных данных приборов учета

    """
    # URL

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Настройки SIM-карт (Pin, APN)

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

    # Получение настроек если поле Data не задано - В Качестве основного используется Запрос GET
    def _getting_settings(self):

        """
        В Классе шаблоне метод получения настроек отвечает за вставку GET запроса
        """
        data = self._request_setting()
        return data

# -------------------------------------------------------------------------------------------------------------
#                                           ПРИМЕР JSON
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Settings":[
# 		{
# 			"id":1,
# 			"type":1,
# 			"storages":[
# 				{
# 					"type":3,
# 					"depth":35
# 				}
# 			]
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
