# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                           Таблица приборов учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия
from JSON_Backend_framework.Service.Template_Devices_Functions.Settings.MeterDevice.Template_MeterTable_settings import \
    TemplateMeterTable


# -------------------------------------------------------------------------------------------------------------


class MeterTable(TemplateMeterTable):
    """
    Таблица приборов учета

    """

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
       Настройки - Таблица Счетчиков

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

    # Получение настроек если поле Data не задано - В Качестве основного используется Запрос GET
    def _getting_settings(self):

        """
        В Классе шаблоне метод получения настроек отвечает за вставку GET запроса
        """
        data = self._request_setting()
        return data
# -------------------------------------------------------------------------------------------------------------
#                                           ПРИМЕР JSON
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Meters":[
# 		{
# 			"id":1,
# 			"pId":0,
# 			"type":1,
# 			"addr":"1",
# 			"passRd":"",
# 			"passWr":"",
# 			"line":0,
# 			"iface":0,
# 			"br":				115200,
# 			"size":				8,
# 			"parity":				2,
# 			"stop":				2,
# 			"rtuObjType":1,
# 			"rtuObjNum":2,
# 			"rtuFider":3,
# 			"archId":3
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
