# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                        ШАБЛОН Таблицы приборов учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Devices_USPD.settings import url_path
from JSON_Backend_framework.Service.TemplateDeviceFunctions import TemplateDeviceFunctions_Settings


class TemplateMeterTable(TemplateDeviceFunctions_Settings):
    """
    ШАБЛОН Таблицы приборов учета

    """
    # URL

    _path_url = url_path.get("MaterTable")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None
    # Переопределяем чтоб можно было достать
    path_url = _path_url
    # Имя поля настроек
    _Settings_name = 'Meters'

# -------------------------------------------------------------------------------------------------------------

# -------------------------------------------------------------------------------------------------------------

