# Здесь расположим Декораторы

# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
# Декоратор логирующий что используются данные из Метода GET

def print_log_use_GET_data(fn):

    def debug(self, *args, **kwargs):
        print("Данных не задано , используется данные из метода GET")
        return fn(self, *args, **kwargs)

    return debug


def read_USPD_Time_Request(fn):

    def debug(self, *args, **kwargs):
        print("Для чтения данных используем Специальный метод")
        return fn(self, *args, **kwargs)

    return debug