# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Настройки регулярной отправки почтовых сообщений
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Settings.Event_System.Template_Actions_SMPT_settings import \
    TemplateActionsSMTP


# -------------------------------------------------------------------------------------------------------------

class ActionsSMTP(TemplateActionsSMTP):
    """
    Настройки регулярной отправки почтовых сообщений

    """

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    # Общие настройки
    # Settings = None

    # Настройки по умолчанию

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Настройки регулярной отправки почтовых сообщений

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                           ПРИМЕР JSON
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Settings":[
# 		{
# 			"emailFromId":1,
# 			"emailToId":1,
# 			"id":1,
# 			"meterMessageId":1
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
