# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Настройки регулярной публикации mqtt сообщений
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Settings.Event_System.Template_Actions_MQTT_settings import \
    TemplateActionsMQTT


# -------------------------------------------------------------------------------------------------------------


class ActionsMQTT(TemplateActionsMQTT):
    """
    Настройки регулярной публикации mqtt сообщений

    """

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    # Общие настройки
    # Settings = None

    # Настройки по умолчанию

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Настройки регулярной публикации mqtt сообщений

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                           ПРИМЕР JSON
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Settings":[
# 		{
# 			"id":1,
# 			"meterMessageId":1,
# 			"brokerId":42,
# 			"topic":"uri/path"
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
