# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Настройки локального времени(Часовой пояс)
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from Service.Template_Devices_Functions.Settings.DeviceSettings.Template_Local_time_settings import TemplateLocalTimeZone

# -------------------------------------------------------------------------------------------------------------


class TimeZone(TemplateLocalTimeZone):
    """
    Настройки локального времени(Часовой пояс)

    """
    # URL
    # from Devices_USPD.settings import url_path
    # _path_url = url_path.get("Settings_SIM")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    # Общие настройки
    # Settings = None

    # Настройки по умолчанию

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Настройки локального времени(Часовой пояс)

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                           ПРИМЕР JSON
# -------------------------------------------------------------------------------------------------------------
#
# -------------------------------------------------------------------------------------------------------------