# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                 Состояние модема
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.State.Template_State_Modem import TemplateStateModem

# -------------------------------------------------------------------------------------------------------------


class StateModem(TemplateStateModem):
    """

    Состояние модема

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Состояние модема

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"info":"Quectel UG95E Revision: UG95ENAR01A09E1G",
# 	"imei":"865789025268089",
# 	"ccid":"8970199171227055379F",
# 	"ops":"Beeline",
# 	"creg":		5,
# 	"cgreg":		5,
# 	"csq":31,
# 	"cpin":"SIM PIN",
# 	"pinRes":true
# }
# -------------------------------------------------------------------------------------------------------------
