# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Ожидаемое время срабатывания расписаний УСПД
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.State.Template_State_Scheduler import TemplateStateScheduler

# -------------------------------------------------------------------------------------------------------------


class StateScheduler(TemplateStateScheduler):
    """

    Ожидаемое время срабатывания расписаний УСПД

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Ожидаемое время срабатывания расписаний УСПД

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"State":[
# 		{
# 			"id":1,
# 			"time":"2018-09-10T03:36:00+03:00"
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
