# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                           Состояние сокетов
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.State.Template_State_Socket import TemplateStateSocket

# -------------------------------------------------------------------------------------------------------------


class StateSocket(TemplateStateSocket):
    """

    Состояние сокетов

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Состояние сокетов

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"num":16,
# 	"State":[
# 		{
# 			"id":0,
# 			"sock":"192.168.202.95:5001",
# 			"peer":"192.168.202.86:15540"
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
