# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                   Состояние последовательных интерфейсов УСПД
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.State.Template_State_UART import TemplateStateUART

# -------------------------------------------------------------------------------------------------------------


class StateUART(TemplateStateUART):
    """

    Состояние последовательных интерфейсов УСПД

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Состояние последовательных интерфейсов УСПД

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"State":[
# 		{
# 			"iface":2,
# 			"lock":true,
# 			"task":"MeterPollUART",
# 			"start":"2018-09-10T03:47:05+03:00",
# 			"end":"2018-09-10T03:47:55+03:00"
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
