# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                           Состояние операционной системы
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.State.Template_State_OS import TemplateStateOS

# -------------------------------------------------------------------------------------------------------------


class StateOS(TemplateStateOS):
    """

    Состояние операционной системы

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Состояние операционной системы

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"osname":"FreeRTOS V9.0.0",
# 	"heapmin":143208,
# 	"heapfree":149088,
# 	"osruntime":"P0DT0H0M47S",
# 	"State":[
# 		{
# 			"id":2,
# 			"name":"IDLE",
# 			"state":				5,
# 			"priority":0,
# 			"stackmin":108,
# 			"runtime":"P0DT0H0M44S"
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
