# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                       Состояние микросхем памяти
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.State.Template_State_DataFlash import TemplateStateDataFlash

# -------------------------------------------------------------------------------------------------------------


class StateDataFlash(TemplateStateDataFlash):
    """

    Состояние микросхем памяти

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Состояние микросхем памяти

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"State":[
# 		{
# 			"id":0,
# 			"sectors":2048,
# 			"size":4096,
# 			"type":"Adesto AT26DF"
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
