# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                       Шаблон запроса данных приборов учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Service.Template_Functional import TemplateFunctional


class TemplateMeterDataArch(TemplateFunctional):
    """
    Шаблон запроса данных приборов учета

    """
    # URL
    from JSON_Backend_framework.Devices_USPD.settings import url_path
    _path_url = url_path.get("Meter_Data_arch")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def request_settings(self, data):
        """
        Запросить данные - POST

        :param data:
        :return:
        """

        # Запаковываем
        data = self._coding(data=data)

        # делаем запрос - получаем ответ
        response = self._request_POST(JSON=data)

        return response

# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------