# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                      Шаблон  - Загрузка файлов обновления ВПО
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Service.Template_Functional import TemplateFunctional


class TemplateUpLoadFirmware(TemplateFunctional):
    """
     Шаблон  - Загрузка файлов обновления ВПО

    """
    # URL
    from JSON_Backend_framework.Devices_USPD.settings import url_path
    _path_url = url_path.get("Upload_firmware")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    # Настройки по умолчанию

