# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Получение Журнала установки связи с MQTT-брокером
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Journal.Template_Journal_MQTT_Connect import TemplateJournalMQTTConnect


# -------------------------------------------------------------------------------------------------------------


class JournalMQTTConnect(TemplateJournalMQTTConnect):
    """
    Получение Журнала установки связи с MQTT-брокером

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Журнал установки связи с MQTT-брокером

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Jrnl":[
# 		{
# 			"id":1,
# 			"connect":"2018-09-03T14:17:33+03:00",
# 			"disconnect":"2019-09-03T14:17:33+03:00",
# 			"address":"10.10.10.1",
# 			"port":1883,
# 			"res":				14
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
