# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Получение Журнала обмена сообщениями с MQTT-брокером
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Journal.Template_Journal_MQTT_Message import TemplateJournalMQTTMessage

# -------------------------------------------------------------------------------------------------------------


class JournalMQTTMessage(TemplateJournalMQTTMessage):
    """
    Получение Журнала обмена сообщениями с MQTT-брокером

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Журнал обмена сообщениями с MQTT-брокером

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address


# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Jrnl":[
# 		{
# 			"id":1,
# 			"time":"2018-09-03T14:17:33+03:00",
# 			"file":"1234",
# 			"topicH":"12/34/in",
# 			"topicL":"/state/dout/get",
# 			"status":				1
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------