# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Получение Журнала обновления ВПО загрузчика
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Journal.Template_Journal_Update_Loader import TemplateJournalUpdateLoader


# -------------------------------------------------------------------------------------------------------------


class JournalUpdateLoader(TemplateJournalUpdateLoader):
    """
    Получение Журнала обновления ВПО загрузчика

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Журнал обновления ВПО загрузчика

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Jrnl":[
# 		{
# 			"id":1,
# 			"time":"2018-09-02T19:09:47+03:00",
# 			"status":0
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
