# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Получение Журнала фиксации ответов приборов учета
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Journal.Template_Journal_Meter_Answer import TemplateJournalMeterAnswer

# -------------------------------------------------------------------------------------------------------------


class JournalMeterAnswer(TemplateJournalMeterAnswer):
    """
    Получение Журнала фиксации ответов приборов учета

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Журнал фиксации ответов приборов учета

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address


# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Jrnl":[
# 		{
# 			"id":1,
# 			"time":"2018-09-05T14:13:07+03:00",
# 			"idMeter":1,
# 			"type":23,
# 			"iface":2,
# 			"addr":"7220",
# 			"answer":false
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
