# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         Получение Журнала отправки SMS
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Journal.Template_Journal_SMS_Send import \
    TemplateJournalSMSSend


# -------------------------------------------------------------------------------------------------------------


class JournalSMSSend(TemplateJournalSMSSend):
    """
    Получение Журнала отправки SMS

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Журнал отправки SMS

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь только чтение
# -------------------------------------------------------------------------------------------------------------
# {
# 	"Jrnl":[
# 		{
# 			"id":205,
# 			"time":"2018-09-03T03:49:08+03:00",
# 			"idMsg":1549643952,
# 			"idTo":1,
# 			"res":				9,
# 			"err":310
# 		}
# 	]
# }
# -------------------------------------------------------------------------------------------------------------
