# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                        Шаблон для перезагрузки
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from Service.Template_Functional import TemplateFunctional


class TemplateDeviceRestart(TemplateFunctional):
    """
    Шаблон для перезагрузки

    """
    # URL
    from Devices_USPD.settings import url_path
    _path_url = url_path.get("Restart")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def restart(self):
        """
        Запросить данные - POST

        :param data:
        :return:
        """

        # Запаковываем
        # data = self._coding(data=data)
        data = ''
        # делаем запрос - получаем ответ
        response = self._request_POST(JSON=data)

        return response

# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------


