# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                     Шаблоны Настройки шаблонов приборов учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from JSON_Backend_framework.Devices_USPD.settings import url_path
from JSON_Backend_framework.Service.TemplateDeviceFunctions import TemplateDeviceFunctions_Settings


class TemplateTemplatesMeter(TemplateDeviceFunctions_Settings):
    """
    Шаблоны Настройки шаблонов приборов учета

    """
    # URL

    _path_url = url_path.get("Templates_Meter")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None
    # Переопределяем чтоб можно было достать
    path_url = _path_url
    # Имя поля настроек
    _Settings_name = 'Settings'
    #

# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
