# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                      Шаблон Журнала фиксации ответов приборов учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

from Service.Template_Functional import TemplateFunctional


class TemplateJournalMeterAnswer(TemplateFunctional):
    """
    Шаблон Журнала фиксации ответов приборов учета

    """
    # URL
    from Devices_USPD.settings import url_path
    _path_url = url_path.get("Journal_Meter_ANSW")

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    # Настройки по умолчанию

    def read_Journal(self):
        """
        Читаем данные - GET
        :return:
        """
        # делаем запрос - получаем ответ
        response = self._request_GET()

        return response
