# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                    Настройки выдачи данных текстового протокола
# -------------------------------------------------------------------------------------------------------------
# Импортируем Шаблон взаимодействия

from JSON_Backend_framework.Service.Template_Devices_Functions.Settings.Proto.Template_Proto_TEXT_data import \
    TemplateProtocolTextData


# -------------------------------------------------------------------------------------------------------------


class ProtocolTextData(TemplateProtocolTextData):
    """
    Настройки выдачи данных текстового протокола
    """

    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    # Общие настройки
    # Settings = None

    # Настройки по умолчанию

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Настройки выдачи данных текстового протокола

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

    # Получение настроек если поле Data не задано - В Качестве основного используется Запрос GET
    def _getting_settings(self):

        """
        В Классе шаблоне метод получения настроек отвечает за вставку GET запроса
        """
        data = self._request_setting()
        return data

# -------------------------------------------------------------------------------------------------------------
#                                           ПРИМЕР JSON
# -------------------------------------------------------------------------------------------------------------
# {
# 	"tariff":		4,
# 	"ap":true,
# 	"am":true,
# 	"rp":true,
# 	"rm":true,
# 	"qual":true
# }
# -------------------------------------------------------------------------------------------------------------
