# Здесь расположим какие нить конфиги

# ЕСли их не будет - Удвалить


# Хедерс - У каждого протокола он свой
# =================================================================
#                   Версии Протокола
# =================================================================
# Хедер который определяет что у нас версия протокола УМ 40 СМАРТ
headers_protocol_UM40 = {
    "X-Protocol-USPD": 40,
    "X-Protocol-Version": 0.1,
}
# Хедер который определяет что у нас версия протокола УМ 31 СМАРТ
headers_protocol_UM31 = {
    "X-Protocol-USPD": 31,
    "X-Protocol-Version": 0.1,
}
# =================================================================
# Словарь с типом протокола - Хедерс
Type_Protocol_Headers_dict = {
    "UM40": headers_protocol_UM40,
    "UM31": headers_protocol_UM31,
}
# =================================================================

