# Здесь расположим Шаблоны USPD
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Прибора учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

class Template_USPD:
    """
    класс - интерфейс от которого наследуются классы УСПД
    """
    # Переменные нужные для авторизации
    # Логин
    _Login = ''
    # Пароль
    _Password = ''

    # Куки
    _cookies = None
    # headers - заголовки
    _headers = None
    # IP Адрес
    _ip_address = None

    # Поля Необходимые для доступа
    # Настройки
    Settings = None
    # Действия
    Action = None

    # USPD = None
    # MeterDevices = None

    # Информация о состоянии изделия
    StateInfo = None
    # Журналы изделия
    Journal = None

    # Управление приборами учетa
    MeterDeviceManagement = None

    # Опрос приборов учета - данные приборов учета
    MeterData = None

    @staticmethod
    def _IP_address_from_config():
        """
        Получаем IP адрес из конфига .ini
        :return:
        """
        from JSON_Backend_framework.Service.config import machine_ip

        return str(machine_ip)

    def _define_functionality(self):
        """
        Функция для получения доступа к Функционалу
        :return:
        """


# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Графы НАСТРОЕК у прибора учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

class Template_UM_XX_SMART_Settings:
    """
    Саб класс который работает с настройками УСПД
    """

    _cookies = None
    _headers = None
    _ip_address = None

    # Функционал

    # Настройки протокола
    Proto = None


    # Файловая система
    DeviceSettings = None

    # Система событий
    EventSystem = None

    # Приборы учета
    # Таблица приборов учета
    Meter = None

    # Настройки модема
    Modem = None

    # Настройки Серверов
    Servers = None

    # # Настройки Ethernet
    # Ethernet = None
    # # Настройки последовательных интерфейсов(UART)
    # Uart = None
    # # Настройки дискретных входов
    # Din = None
    # # Настройки линий питания интерфейсов
    # Dout = None
    #
    # # Настройки локального времени
    # Local_time = None

    #




# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Опрос Приборов Учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
class Template_UM_XX_SMART_MeterData:
    """
    Саб класс который работает с разделом УСПД :  Опрос Приборов Учета
    """

    _cookies = None
    _headers = None
    _ip_address = None

    # Функционал
    # Опрос приборов учета
    MeterData = None
    # Опрос приборов учета – Архивные записи
    MeterData_Arch = None
    # Опрос приборов учета – Моментные показатели
    MeterData_Moment = None


# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Управление приборами учета
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
class Template_UM_XX_SMART_MeterDeviceManagement:
    """
    Саб класс который работает с разделом УСПД :  Управление приборами учета
    """

    _cookies = None
    _headers = None
    _ip_address = None

    # Функционал
    # Управление реле
    Relay = None
    # Установка времени – Системное время счетчика
    Set_Time_Meter = None


# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Графы Действия
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
class Template_UM_XX_SMART_Actions:
    """
    Саб класс который работает с разделом УСПД :  Действия
    """

    _cookies = None
    _headers = None
    _ip_address = None

    # Функционал
    # Перезагрузка
    Restart = None
    # Установка времени – Системное время устройства
    Set_Time = None


# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Графы Журналы изделия
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
class Template_UM_XX_SMART_Journal:
    """
    Саб класс который работает с разделом УСПД :  Журналы изделия
    """

    _cookies = None
    _headers = None
    _ip_address = None

    # Функционал
    # Журнал изменения времени
    Time = None
    # Журнал фиксации ответов приборов учета
    Meter_answer = None


# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                            ШАБЛОН Графы Информация о состоянии изделия
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------

class Template_UM_XX_SMART_State:
    """
    Саб класс который работает с разделом УСПД :  Информация о состоянии изделия
    """

    _cookies = None
    _headers = None
    _ip_address = None

    # Функционал

    #   Состояние линий питания интерфейсов
    DOut = None
    #   Состояние дискретных входов
    DIn = None
    #   Состояние аналоговых входов
    AIn = None
    # Ожидаемое время срабатывания расписаний
    Scheduler = None
    # 	Состояние последовательных интерфейсов
    UART = None
    #   Состояние сетевых подключений
    Network = None
    # 	Состояние сокетов
    Socket = None
    # 	Состояние микросхем памяти
    DataFlash = None
    # 	Состояние файловой системы
    FileSystem = None
    # 	Состояние модема
    Modem = None
    # 	Состояние операционной системы
    OS = None
    # 	Состояние таблицы приборов учета
    MeterTable = None
    # 	Текущее время
    Time = None
    # Информация о конфигурации системы
    System = None
