# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
#                                         # Поверка внешних ЧРВ
# -------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------
from JSON_Backend_framework.Service.Template_Devices_Functions.Actions.Template_Action_Time_check import \
    TemplateActionTimeCheck


class ActionTimeCheck(TemplateActionTimeCheck):
    """
    Поверка внешних ЧРВ

    """
    # хедерс - Иногда нужен
    _headers = None
    # куки
    _cookies = None

    def __init__(self, cookies=None, headers=None, ip_address=None):
        """
        Поверка внешних ЧРВ

        :param cookies:
        :param headers:
        """
        if cookies is not None:
            self._cookies = cookies
        if headers is not None:
            self._headers = headers

        if ip_address is not None:
            self._ip_address = ip_address

# -------------------------------------------------------------------------------------------------------------
#                                     ПРИМЕР JSON - Здесь задаем
# -------------------------------------------------------------------------------------------------------------
# {
# 	"state": false
# }
# -------------------------------------------------------------------------------------------------------------
